{
  "backend/main.mo": "Motoko canister implementing auth-protected user profiles, placeholder product APIs, admin-only product actions, and Stripe configuration handling.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining base styles, color variables, and dark mode theme tokens.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration defining all public, auth-gated, and admin-gated routes within AppShell.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading and icon states.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Admin-gated wrapper that checks authentication and admin status, showing an access denied screen otherwise.",
  "frontend/src/components/auth/RequireAuth.tsx": "Authentication guard showing a sign-in prompt for unauthenticated users.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper combining Header, Footer, main content, and the ProfileSetupModal.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with quick links, category links, and attribution including dynamic year and referral tracking.",
  "frontend/src/components/layout/Header.tsx": "Implements a responsive header with navigation, mobile menu, auth-aware links, and admin/user actions.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to enter a display name and saves the profile via mutation.",
  "frontend/src/data/catalogTaxonomy.ts": "Defines category and brand data plus helper functions to query them.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Checks if the current authenticated actor is an admin using a backend call.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity auth, exposing identity state, sign-in/out, and login status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, persistent identity loading, login handling, and identity lifecycle management.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user profiles, product lookups, and Stripe configuration via the actor.",
  "frontend/src/index.css": "Tailwind base and theme definitions for a blue professional eCommerce style with light/dark mode variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider, rendering the App component.",
  "frontend/src/pages/AboutContactPage.tsx": "Displays company information, contact details, and business hours using styled cards.",
  "frontend/src/pages/AccountPage.tsx": "Fetches and updates the user's profile with form inputs for name, phone, and address.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin landing page listing navigation cards for managing products, orders, users, support, and reports.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays an empty state for order management with a link back to the admin dashboard.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Shows a disabled product management interface with an empty state awaiting future features.",
  "frontend/src/pages/admin/AdminReportsPage.tsx": "Displays placeholder sales metrics and an empty state for future analytics.",
  "frontend/src/pages/admin/AdminSupportTicketsPage.tsx": "Shows an empty state for support ticket management with dashboard navigation.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Renders an admin users page with a back button and a placeholder card indicating no registered users yet. Provides UI structure for future user management features.",
  "frontend/src/pages/BrandPage.tsx": "Shows brand info from URL params and displays a placeholder when no products exist.",
  "frontend/src/pages/CartPage.tsx": "Renders an empty cart message with a link to continue shopping.",
  "frontend/src/pages/CategoryPage.tsx": "Shows a category header, its brands grid, and placeholder product listings.",
  "frontend/src/pages/CheckoutPage.tsx": "Displays a placeholder checkout screen with links to cart and policy pages.",
  "frontend/src/pages/HomePage.tsx": "Home landing page with hero banner and category navigation cards.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Shows placeholder order details using an orderId from URL params.",
  "frontend/src/pages/OrdersPage.tsx": "Displays an empty orders message with a prompt to start shopping.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with retry and return-to-cart actions.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a confirmation message after successful payment with links to orders and home.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the site's privacy policy with sections on data collection, use, security, and rights.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Renders a placeholder product detail view using the productId param with static info and disabled cart button.",
  "frontend/src/pages/SupportPage.tsx": "Provides a form for submitting support tickets with client-side validation and simulated submission.",
  "frontend/src/pages/TermsPage.tsx": "Shows the site's terms and conditions with sections on products, pricing, orders, returns, and more.",
  "frontend/src/utils/errors.ts": "Provides utility functions for extracting user-friendly error messages and logging auth or mutation errors. Handles specific auth-related message patterns.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and retrieving them with fallback. Includes helpers for managing hash-based routing parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, shadows, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Stores current project metadata including features, architecture notes, known issues, and required images for a multi‑vendor eCommerce app."
}